dresden-elektronik/openthread-r21/src/HAL/samr21Radio.c
// Author Eric Härtel @ dresden elektronik ingenieurtechnik gmbh © 2022

#include "samr21Radio.h"

// Ringbuffer for Transmissions
static struct RingTransmissionBuffer
{
    JobBuffer_t bufferData[NUM_RADIO_JOB_BUFFER];
    uint8_t activeBufferIndex;
} s_ringTransmissionBuffer;

static JobBuffer_t *sf_ringBufferGetCurrent()
{
    return &(s_ringTransmissionBuffer.bufferData[s_ringTransmissionBuffer.activeBufferIndex]);
};

static JobBuffer_t *sf_ringBufferGetNext()
{
    return &(s_ringTransmissionBuffer.bufferData[(s_ringTransmissionBuffer.activeBufferIndex + 1) % NUM_RADIO_JOB_BUFFER]);
};

static void sf_ringBufferMoveForward()
{
    s_ringTransmissionBuffer.activeBufferIndex = (s_ringTransmissionBuffer.activeBufferIndex + 1) % NUM_RADIO_JOB_BUFFER;
    samr21RadioFsmChangeJobStatePointer(
        &(s_ringTransmissionBuffer.bufferData[s_ringTransmissionBuffer.activeBufferIndex].jobState)
    );
};

//Frame Pending Table Short Addr
static struct framePendingTableShortAddr
{
    uint16_t addr[SIZE_TABLE_FRAME_PENDING_SHORT_ADDR];
    uint8_t size;
} s_framePendingTableShortAddr;

//Frame Pending Table IEEE Addr
static struct framePendingTableIeeeAddr
{
    uint64_t addr[SIZE_TABLE_FRAME_PENDING_IEEE_ADDR];
    uint8_t size;
} s_framePendingTableIeeeAddr;


static RadioState s_radioState = RADIO_STATE_IDLE;

// Local Register Copys of At86rf233 to save some Read Acceses
extern AT86RF233_REG_TRX_STATUS_t   g_trxStatus;  // from samr21trx.c
extern AT86RF233_REG_IRQ_STATUS_t   g_trxLastIrq; // from samr21trx.c
extern AT86RF233_REG_TRX_CTRL_0_t   g_trxCtrl0;   // from samr21trx.c

static AT86RF233_REG_PHY_CC_CCA_t   s_phyCcCcaReg;
static AT86RF233_REG_PHY_RSSI_t     s_phyRssi;
static AT86RF233_REG_CCA_THRES_t    s_ccaThres;

static AT86RF233_REG_TRX_CTRL_1_t   s_trxCtrl1 =
    {
        .bit.irqPolarity = 0,
        .bit.irqMaskMode = 0,
        .bit.spiCmdMode = 0x1,
        .bit.rxBlCtrl = 1,
        .bit.txAutoCrcOn = 1,
        .bit.irq2ExtEn = 0,
        .bit.paExtnEn = 0
    };

static AT86RF233_REG_PHY_TX_PWR_t   s_phyTxPwr =
    {
        .bit.txPwr = 0x7
    };

static AT86RF233_REG_IRQ_MASK_t     s_irqMask =
    {
        .bit.pllLock = 1,
        .bit.pllUnlock = 0,
        .bit.rxStart = 1,
        .bit.trxEnd = 1,
        .bit.ccaEdDone = 1,
        .bit.addressMatch = 1,
        .bit.bufferUnderRun = 1,
        .bit.batteryLow = 0
    };

// 802_15_4 "Mac-Lite" Vars
static uint8_t s_numMaxTransmissionRetrys = 3;
static uint8_t s_numMaxCsmaBackoffs = 4;

static uint32_t s_csmaBackoffIntervallMin_us    = 16;   // SYMBOL_DURATION_802_15_4_us*((2^minBE)-1) (default: minBE = 1)
static uint32_t s_csmaBackoffIntervallMax_us    = 240;  // SYMBOL_DURATION_802_15_4_us*((2^maxBE)-1) (default: maxBE = 4)
static uint32_t s_csmaBackoffIntervallDiff_us   = 224; // sCsmaBackoffIntervallMax - sCsmaBackoffIntervallMax
static uint32_t s_csmaBackoffIntervallStep_us   = 14;  // sCsmaBackoffIntervallDiff / 16, need cause at86rf233 can create 2 Random bits per SPI Read 

const static uint16_t s_ackMaxWaitDuration_us   = 250; // 12 * SYMBOL_DURATION_802_15_4_us
static uint16_t s_transmissionTimeout_us        = 0xFFFF;

static uint8_t s_ieeeAddr[8];
static uint8_t s_shortAddr[2];
static uint8_t s_panId[2];

//TX Power Table (Factor x4 for Resolution and to avoid float)(r21 Datasheet Table 38-9)
#define SIZE_AT86RF233_TX_POWER_TABLE 16
static const int8_t s_txPowerTable[SIZE_AT86RF233_TX_POWER_TABLE]={16,15,14,12,10,8,4,0,-4,-8,-12,-16,-24,-32,-48,-68};

void samr21RadioInit()
{
    //Write default Values to Config Registers of AT86rf233 (that are not allrdy writen by samr21TrxInterfaceInit)
    samr21TrxWriteRegister(TRX_CTRL_1_REG, s_trxCtrl1.reg);
    samr21TrxWriteRegister(PHY_TX_PWR_REG, s_phyTxPwr.reg);
    samr21TrxWriteRegister(IRQ_MASK_REG, s_irqMask.reg);


    // Get TRX into RX State
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_FORCE_TRX_OFF);
    while (g_trxStatus.bit.trxStatus != TRX_STATUS_TRX_OFF){
        samr21TrxUpdateStatus();
    }

    // Setup ringBuffer
    s_ringTransmissionBuffer.activeBufferIndex = 0;
    for(uint8_t i = 0; i < NUM_RADIO_JOB_BUFFER; i++){
        s_ringTransmissionBuffer.bufferData->jobState = RADIO_JOB_STATE_IDLE;
    }

    // Setup inital State for FSM
    samr21RadioFsmChangeJobStatePointer(&(sf_ringBufferGetCurrent()->jobState));

    // Enable IRQ via EIC
    // Reset first and wait for reset to finish
    EIC->CTRL.bit.SWRST = 1;
    while (EIC->STATUS.bit.SYNCBUSY);
    while (EIC->CTRL.bit.SWRST);

    // Enable EXINT[0]
    EIC->CONFIG[0].bit.FILTEN0 = 0;
    EIC->CONFIG[0].bit.SENSE0 = EIC_CONFIG_SENSE0_RISE_Val;
    EIC->INTENSET.bit.EXTINT0 = 1;

    // Enable Module
    EIC->CTRL.bit.ENABLE = 1;
    while (EIC->STATUS.bit.SYNCBUSY);
    while (!(EIC->CTRL.bit.ENABLE));

    EIC->INTFLAG.bit.EXTINT0 = 1;

    //Read Once to clear all pending Interrupts
    samr21TrxReadRegister(IRQ_STATUS_REG);

    // Enable IRQ in NVIC
    __NVIC_EnableIRQ(EIC_IRQn);
}

void samr21RadioChangeState(RadioState newState, uint8_t channel){
    switch (newState)
    {
    case RADIO_STATE_IDLE:
        samr21RadioFsmEnable(false);
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_FORCE_TRX_OFF);
        s_radioState = RADIO_STATE_IDLE;
        break;

    case RADIO_STATE_SLEEP:
        //Real SleepMode cant be used cause the MCLK form TRX would be disabled
        samr21RadioFsmEnable(false);
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_FORCE_TRX_OFF);
        s_radioState = RADIO_STATE_SLEEP;
        break;

    case RADIO_STATE_RX:
        //Look if channel needs to be changed
        if( channel && ( channel != s_phyCcCcaReg.bit.channel ) ){
            s_phyCcCcaReg.bit.channel = channel;
            samr21TrxWriteRegister(PHY_CC_CCA_REG, s_phyCcCcaReg.reg);
        }
        samr21RadioFsmEnable(true);
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        s_radioState = RADIO_STATE_RX;
        break;

    case RADIO_STATE_TX:
        //Look if channel needs to be changed
        if( channel && ( channel != s_phyCcCcaReg.bit.channel ) ){
            s_phyCcCcaReg.bit.channel = channel;
            samr21TrxWriteRegister(PHY_CC_CCA_REG, s_phyCcCcaReg.reg);
        }
        samr21RadioFsmEnable(true);

        //RX_ON, cause almost all transmissions start with a CCA
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        s_radioState = RADIO_STATE_TX;
        break;
    
    default:
        break;
    }
}

