dresden-elektronik/openthread-r21/src/HAL/samr21Radio.c
RadioState samr21RadioGetStatus(){
    return s_radioState;
}

void samr21RadioSetTxPower(int8_t txPower)
{
    txPower *= 4; // multiply by 4 (for resolution in txPowerTable)

    for(uint8_t i = 0; i < SIZE_AT86RF233_TX_POWER_TABLE; i++){
        if(
            (s_txPowerTable[i] >= txPower)
            && (s_txPowerTable[i+1] <= txPower)
        ){
            s_phyTxPwr.bit.txPwr = i;
            goto writeReg;
        }
    }

    //Default
    s_phyTxPwr.bit.txPwr = 0x7;

writeReg:
    samr21TrxWriteRegister(PHY_TX_PWR_REG, s_phyTxPwr.reg);
}

int8_t samr21RadioGetTxPower(){
    return s_txPowerTable[s_phyTxPwr.bit.txPwr] >> 2; // devide by 4
}

uint8_t samr21RadioReadLastEDMeasurment()
{
    return samr21TrxReadRegister(PHY_ED_LEVEL_REG);
}

uint8_t samr21RadioGetRandomCrumb()
{
    return (samr21TrxReadRegister(PHY_RSSI_REG) >> 5) & 0b00000011;
}
uint8_t samr21RadioGetRandomNibble()
{
    return ((samr21TrxReadRegister(PHY_RSSI_REG) >> 5) & 0b00000011) | ((samr21TrxReadRegister(PHY_RSSI_REG) >> 3) & 0b00001100);
}
uint8_t samr21RadioGetRandomByte()
{
    uint8_t rVal = (samr21TrxReadRegister(PHY_RSSI_REG) & 0x60) >> 5;
    rVal |= (samr21TrxReadRegister(PHY_RSSI_REG) & 0x60) >> 3;
    rVal |= (samr21TrxReadRegister(PHY_RSSI_REG) & 0x60) >> 1;
    rVal |= (samr21TrxReadRegister(PHY_RSSI_REG) & 0x60) << 1;
    return rVal;
}

void samr21RadioSetShortAddr(uint8_t* shortAddr)
{
    s_shortAddr[0] = shortAddr[0];
    s_shortAddr[1] = shortAddr[1];

    samr21TrxWriteRegister(SHORT_ADDR_0_REG, shortAddr[0]);
    samr21TrxWriteRegister(SHORT_ADDR_1_REG, shortAddr[1]);
}

void samr21RadioSetPanId(uint8_t* panId)
{
    s_panId[0] = panId[0];
    s_panId[1] = panId[1];

    samr21TrxWriteRegister(PAN_ID_0_REG, panId[0]);
    samr21TrxWriteRegister(PAN_ID_1_REG, panId[1]);
}

void samr21RadioSetIeeeAddr(uint8_t* ieeeAddr)
{
    for (uint8_t i = 0; i < 8; i++) // IEEE address has 8 bytes
    {
        s_ieeeAddr[i] = ieeeAddr[i];
        samr21TrxWriteRegister(IEEE_ADDR_0_REG + i, ieeeAddr[i]);
    }
}

void samr21RadioChangeChannel(uint8_t newChannel)
{
    s_phyCcCcaReg.bit.channel = newChannel;
    samr21TrxWriteRegister(PHY_CC_CCA_REG, s_phyCcCcaReg.reg);
}

void samr21RadioChangeCCAMode(uint8_t newCcaMode)
{
    s_phyCcCcaReg.bit.ccaMode = newCcaMode;
    samr21TrxWriteRegister(PHY_CC_CCA_REG, s_phyCcCcaReg.reg);
}

void samr21RadioSetCcaThreshold(int8_t threshold)
{
    int8_t diff = (AT86RF233_RSSI_BASE_VAL - threshold);
    s_ccaThres.bit.ccaEdThres = abs(diff) >> 1; //Devide by 2

    samr21TrxWriteRegister(CCA_THRES_REG, s_ccaThres.reg);
}

int8_t samr21RadioGetCurrentCcaThreshold()
{
    return ( AT86RF233_RSSI_BASE_VAL + ( s_ccaThres.bit.ccaEdThres << 1 ) ); //Multiply by 2
}

void samr21RadioChangeCsmaBackoffExponent(uint8_t minBE, uint8_t maxBE)
{
    s_csmaBackoffIntervallMin_us = ((1 << minBE) - 1) * SYMBOL_DURATION_802_15_4_us;
    s_csmaBackoffIntervallMax_us = ((1 << maxBE) - 1) * SYMBOL_DURATION_802_15_4_us;
    s_csmaBackoffIntervallDiff_us = s_csmaBackoffIntervallMax_us - s_csmaBackoffIntervallMin_us;
}

void samr21RadioChangeNumBackoffsCsma(uint8_t numBackoffs)
{
    s_numMaxCsmaBackoffs = numBackoffs;
}

void samr21RadioChangeNumTransmitRetrys(uint8_t numRetrys)
{
    s_numMaxTransmissionRetrys = numRetrys;
}



/*------------------*/
// Interface Functions
/*------------------*/
bool samr21RadioSendFrame(FrameBuffer_t *frame, uint8_t channel)
{
    // Get the next avivable Buffer
    __disable_irq();
    JobBuffer_t *buffer = sf_ringBufferGetNext();

    //Check if Last Queued Transmission did even start yet
    if(buffer->jobState == RADIO_JOB_STATE_TX_READY){
        __enable_irq();
        return false;
    }

    // mark buffer as in Setup
    buffer->jobState = RADIO_JOB_STATE_IN_SETUP;
    __enable_irq();

    buffer->channel = channel;
    // Fill buffer (dirty memcpy)
    for (uint8_t i = 0; i <= frame->header.lenght; i++)
    {
        buffer->outboundFrame.raw[i] = frame->raw[i];
    }
    buffer->retrysLeft.csma = s_numMaxCsmaBackoffs;
    buffer->retrysLeft.transmission = s_numMaxTransmissionRetrys;
    

    // If Radio is in an Idle State, send immediately
    __disable_irq();
    buffer->jobState = RADIO_JOB_STATE_TX_READY;
    
    if (
        sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_IDLE
        || sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_RX_IDLE
        || sf_ringBufferGetCurrent()->jobState > MARKER_RADIO_JOB_STATES_BEGINN_OTHER_DONE
    ){
        samr21RadioChangeState(RADIO_STATE_TX, buffer->channel);
        // Make prepared Buffer the active One
        sf_ringBufferMoveForward();
        __enable_irq();

        // Jump Start Statemachnine
        samr21RadioFsmHandleEvent(RADIO_SOFTEVENT_START_TX);
        return true;
    }

    __enable_irq();
    return true;
}

bool samr21RadioReceive(uint8_t channel)
{
    __disable_irq();

    if(
        sf_ringBufferGetCurrent()->channel == channel
        && sf_ringBufferGetCurrent()->jobState > MARKER_RADIO_JOB_STATES_BEGINN_RX
        && sf_ringBufferGetCurrent()->jobState < MARKER_RADIO_JOB_STATES_END_RX
    ){
        __enable_irq();
        return true;
    }

    // Get the next avivable Buffer
    JobBuffer_t *buffer = sf_ringBufferGetNext();

    //Check if Last Queued Transmission did even start yet
    if(buffer->jobState == RADIO_JOB_STATE_TX_READY){
        __enable_irq();
        return false;
    }

    buffer->jobState = RADIO_JOB_STATE_RX_IDLE;
    
    if (
        sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_IDLE
        || sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_RX_IDLE
        || sf_ringBufferGetCurrent()->jobState > MARKER_RADIO_JOB_STATES_BEGINN_OTHER_DONE
    ){
        samr21RadioChangeState(RADIO_STATE_RX, buffer->channel);
        // Make prepared Buffer the active One
        sf_ringBufferMoveForward();

        __enable_irq();
        return true;
    }

    __enable_irq();
    return true;
}

bool samr21RadioStartEnergyDetection(uint8_t channel, uint16_t duration)
{
    // Get the next avivable Buffer
    __disable_irq();
    JobBuffer_t *buffer = sf_ringBufferGetNext();

    //Check if Last Queued Transmission did even start yet
    if(buffer->jobState == RADIO_JOB_STATE_TX_READY){
        __enable_irq();
        return false;
    }

    // mark buffer 
    buffer->jobState = RADIO_JOB_STATE_ED_READY;
    buffer->edTimeleft = duration;
    buffer->measuredEngeryLevel = 0;
    buffer->channel = channel;

