dresden-elektronik/openthread-r21/src/HAL/samr21Radio.c
    // If Radio is in an Idle State, start immediately
    if (
        sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_IDLE
        || sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_RX_IDLE
        || sf_ringBufferGetCurrent()->jobState > MARKER_RADIO_JOB_STATES_BEGINN_OTHER_DONE
    ){
        samr21RadioChangeState(RADIO_STATE_RX, buffer->channel);
        // Make prepared Buffer the active One
        sf_ringBufferMoveForward();

        __enable_irq();
        // Jump Start Statemachnine
        samr21RadioFsmHandleEvent(RADIO_SOFTEVENT_START_ED);
        return true;
    }

    __enable_irq();
    return true;
}


JobBuffer_t* samr21RadioGetNextFinishedJobBuffer(){
    for (uint8_t i = 0; i < NUM_RADIO_JOB_BUFFER; i++){
        if(s_ringTransmissionBuffer.bufferData[i].jobState > MARKER_RADIO_JOB_STATES_BEGINN_OTHER_DONE){
            return &(s_ringTransmissionBuffer.bufferData[i]);
        }
    }
    return NULL;
}


bool samr21RadioAddShortAddrToPendingFrameTable(uint16_t shortAddr){
    if(s_framePendingTableShortAddr.size >= SIZE_TABLE_FRAME_PENDING_SHORT_ADDR){
        //No Space left
        return false;
    }

    s_framePendingTableShortAddr.addr[s_framePendingTableShortAddr.size++] = shortAddr;
    return true;
} 

bool samr21RadioFindShortAddrInPendingFrameTable(uint16_t shortAddr, bool remove){
    for (uint8_t i = 0; i < SIZE_TABLE_FRAME_PENDING_SHORT_ADDR; i++)
    {
        if(s_framePendingTableShortAddr.addr[i] == shortAddr){

            if(remove){
                s_framePendingTableShortAddr.addr[i] = s_framePendingTableShortAddr.addr[s_framePendingTableShortAddr.size--];
            }   
            return true;
        }
    }
    //Address not found, can't be removed
    return false;
} 

void samr21RadioClearShortAddrPendingFrameTable(){
    s_framePendingTableShortAddr.size = 0;
} 

bool samr21RadioAddIeeeAddrToPendingFrameTable(uint64_t ieeeAddr){
    if(s_framePendingTableIeeeAddr.size >= SIZE_TABLE_FRAME_PENDING_IEEE_ADDR){
        //No Space left
        return false;
    }
    s_framePendingTableIeeeAddr.addr[s_framePendingTableIeeeAddr.size++] = ieeeAddr;
    return true;
} 

bool samr21RadioFindIeeeAddrInPendingFrameTable(uint64_t ieeeAddr, bool remove){

    //Split the addr into 2 Half Words, cause the M0+ is 32 Bit based, so time can be saved
    uint32_t addrLowerHalfWord = ((uint32_t*)(&ieeeAddr))[0];
    uint32_t addrUpperHalfWord = ((uint32_t*)(&ieeeAddr))[1];

    for (uint8_t i = 0; i < SIZE_TABLE_FRAME_PENDING_SHORT_ADDR; i++)
    {
        //only check lower Halfword first to safe some Time
        if(((uint32_t*)(&s_framePendingTableIeeeAddr.addr[i])[0]) != addrLowerHalfWord){
            continue;     
        }

        //if the lower Halfword matches, the upper Halfword is also checked
        if(((uint32_t*)(&s_framePendingTableIeeeAddr.addr[i])[1]) == addrUpperHalfWord){

            if(remove){
                s_framePendingTableIeeeAddr.addr[i] = s_framePendingTableIeeeAddr.addr[s_framePendingTableIeeeAddr.size--];
            }

            return true;
        }
    }

    //Address not found
    return false;
} 

void samr21RadioClearIeeeAddrPendingFrameTable(){
    s_framePendingTableIeeeAddr.size = 0;
} 

/*------------------*/
// State Machine Transition Functions
/*------------------*/
void fsm_func_samr21RadioStartCCA()
{
    // Start TimeoutTimer
    if(sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_TX_READY){
        samr21Timer5Set(s_transmissionTimeout_us);
    }

    // Check if Transciver is in recive state
    if (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON)
    {
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        while (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON){
            samr21TrxUpdateStatus();
        }
    }

    // Prepare CCA Measurment
    s_phyCcCcaReg.bit.ccaRequest = 1;

    // Start CCA Measurment
    samr21TrxWriteRegister(PHY_CC_CCA_REG, s_phyCcCcaReg.reg);

    // Reset local copy of ccaRequest Bit
    s_phyCcCcaReg.bit.ccaRequest = 0;
}

void fsm_func_samr21StartEd()
{   
    // Check if Transciver is in recive state
    if (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON)
    {
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        while (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON){
            samr21TrxUpdateStatus();
        }
    }

    // Prepare CCA Measurment
    s_phyCcCcaReg.bit.ccaRequest = 1;

    // Start CCA Measurment
    samr21TrxWriteRegister(PHY_CC_CCA_REG, s_phyCcCcaReg.reg);

    // Reset local copy of ccaRequest Bit
    s_phyCcCcaReg.bit.ccaRequest = 0;

    //Queue the next ED allrdy (once per ms)
    samr21Timer4Set(1000);
}

void fsm_func_samr21RadioEvalCCA()
{
    if (g_trxStatus.bit.ccaStatus)
    {
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_CHANNEL_CLEAR);
        return;
    }

    if(sf_ringBufferGetCurrent()->retrysLeft.csma--){
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_CHANNEL_BUSY);
        return;
    }

    samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_NO_RETRYS_LEFT);
    return; 
}

void fsm_func_samr21RadioStartBackoffTimer()
{
    samr21Timer4Set((s_csmaBackoffIntervallStep_us * samr21RadioGetRandomNibble()) + s_csmaBackoffIntervallMin_us);
}

void fsm_func_samr21RadioSendTXPayload()
{
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_FORCE_PLL_ON);
        while (g_trxStatus.bit.trxStatus != TRX_STATUS_PLL_ON){
            samr21TrxUpdateStatus();
        }

    __disable_irq();
    // Start Trasmission
    samr21TrxSetSLP_TR(true);

    // add tx timestamp
    sf_ringBufferGetCurrent()->txTimestamp = samr21RtcGetTimestamp();

    // Enable SPI Slave Select, to start uploading the Frame Payload in parallel while SHR is still being send

    samr21TrxSetSSel(true);

    samr21delayLoop(CPU_WAIT_CYCLE_AFTER_SSEL_LOW);

    // Transmission should have started here allrdy so trigger can be disabled
    samr21TrxSetSLP_TR(false);

    // Send Write Frame Buffer Command and get Status Byte (see r2 datasheet 35.4 Radio Transceiver Status Information)
    g_trxStatus.reg = samr21TrxSpiTransceiveByteRaw(AT86RF233_CMD_FRAMEBUFFER_WRITE);

    if (g_trxStatus.bit.trxStatus != TRX_STATUS_BUSY_TX)
    {
        samr21TrxSetSSel(false);
        samr21RadioFsmQueueSoftEvent(RADIO_EVENT_ERROR);
        return;
    }

