dresden-elektronik/openthread-r21/src/HAL/samr21Radio.c
    // Leave the Last 2 Bytes empty cause CRC is generated by at86rf233
    for (int16_t i = 0; i <= (sf_ringBufferGetCurrent()->outboundFrame.header.lenght - IEEE_802_15_4_CRC_SIZE); i++)
    {
        samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
        samr21TrxSpiTransceiveByteRaw(sf_ringBufferGetCurrent()->outboundFrame.raw[i]);
    }

    // Disable Slave Select
    samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
    samr21TrxSetSSel(false);
    __enable_irq();

    if (sf_ringBufferGetCurrent()->outboundFrame.header.frameControlField1.ackRequest)
    {
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_ACK_REQUESTED);
    }

    // Queue Move to RX
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
}

void fsm_func_samr21RadioJobCleanup()
{
    __disable_irq();
    // Stop Pending Timer
    samr21Timer4Stop();
    samr21Timer5Stop();

    // Look for a Queued Transmission
    if (sf_ringBufferGetNext()->jobState == RADIO_JOB_STATE_TX_READY)
    {
        samr21RadioChangeState(RADIO_STATE_TX, sf_ringBufferGetNext()->channel);
        // Make prepared Buffer the active One
        sf_ringBufferMoveForward();

        // Jump Start Next Statemachnine
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_START_TX);
        
        goto exit;
    }

    // Move to next buffer, Unless a TX Transmisssion is in setup
    if (sf_ringBufferGetNext()->jobState == RADIO_JOB_STATE_IN_SETUP){
        //Do nothing the samr21RadioSendFrame-func will jumpstart the statemachine once the setup is completed
        goto exit;
    }

    // Look for a Queued Energy Scans
    if (sf_ringBufferGetNext()->jobState == RADIO_JOB_STATE_ED_READY)
    {
        samr21RadioChangeState(RADIO_STATE_RX, sf_ringBufferGetNext()->channel);
        // Make prepared Buffer the active One
        sf_ringBufferMoveForward();

        // Jump Start Next Statemachnine
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_START_ED);
        
        goto exit;
    }

    // Move to next buffer, when in RX Mode so next frame can be recived
    if (sf_ringBufferGetCurrent()->jobState == RADIO_JOB_STATE_RX_DONE)
    {
        // Prepare the next Buffer
        sf_ringBufferGetNext()->jobState = RADIO_JOB_STATE_RX_IDLE;
        sf_ringBufferGetNext()->channel  = sf_ringBufferGetCurrent()->channel;
        // Move to Next Buffer
        sf_ringBufferMoveForward();
        goto exit;
    }

exit:
    __enable_irq();
    return;
}

void fsm_func_samr21RadioWaitForAck()
{
    samr21Timer4Set(s_ackMaxWaitDuration_us);
}

void fsm_func_samr21RadioAckReceptionStarted(){
    samr21Timer4Stop();
}

void fsm_func_samr21RadioEvalRetransmission()
{
    if(sf_ringBufferGetCurrent()->retrysLeft.transmission--){
        sf_ringBufferGetCurrent()->retrysLeft.csma = s_numMaxCsmaBackoffs;
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_START_TX);
        return;
    }

    samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_NO_RETRYS_LEFT);
    return;
}

void fsm_func_samr21RadioEvalAck()
{
    samr21Timer4Stop();

    __disable_irq();

    //get current JobBuffer
    JobBuffer_t* buffer = sf_ringBufferGetCurrent();

    // add rx timestamp
    buffer->rxTimestamp = samr21RtcGetTimestamp();

    // Enable SPI Slave Select
    samr21TrxSetSSel(true);
    samr21delayLoop(CPU_WAIT_CYCLE_AFTER_SSEL_LOW);

    // Send Read Frame Buffer Command and get Status Byte (see r21 datasheet 35.4 Radio Transceiver Status Information)
    g_trxStatus.reg = samr21TrxSpiTransceiveByteRaw(AT86RF233_CMD_FRAMEBUFFER_READ);

    // First Byte is the msg Lenght
    samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
    buffer->inboundFrame.header.lenght = samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

    if(buffer->inboundFrame.header.lenght > IEEE_802_15_4_PDSU_SIZE){
        samr21TrxSetSSel(false);
        __enable_irq();
        goto ackInvalid;
    }

    // Download Recived Frame
    for (uint8_t i = 1; i <= (buffer->inboundFrame.header.lenght); i++)
    {
        samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
        sf_ringBufferGetCurrent()->inboundFrame.raw[i] = samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);
    }

    // 3 Byte after the msg Frame are LQI,RSSI and CRC Informations (see r21 datasheet 35.3.2 Frame Buffer Access Mode)
    samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
    buffer->rxLQI = samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

    samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
    buffer->rxRSSI = AT86RF233_RSSI_BASE_VAL + samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

    AT86RF233_REG_RX_STATUS_t rxStatus = (AT86RF233_REG_RX_STATUS_t)samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

    // Disable Slave Select
    samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
    samr21TrxSetSSel(false);
    __enable_irq();

    if (!rxStatus.bit.crcValid)
    {
        goto ackInvalid;
    }

    if (buffer->inboundFrame.header.sequenceNumber != buffer->outboundFrame.header.sequenceNumber)
    {
        goto ackInvalid;
    }

ackValid:
    samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_ACK_VALID);
    return;

ackInvalid:
    if(sf_ringBufferGetCurrent()->retrysLeft.transmission--){
        sf_ringBufferGetCurrent()->retrysLeft.csma = s_numMaxCsmaBackoffs;
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_ACK_INVALID);
        return;
    }

    samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_NO_RETRYS_LEFT);
    return;
}

void fsm_func_samr21RadioTxAbort()
{
    __NOP();
}

void fsm_func_samr21RadioLiveRxParser()
{
    __disable_irq();

    // add rx timestamp
    JobBuffer_t * buffer = sf_ringBufferGetCurrent();
    buffer->rxTimestamp = samr21RtcGetTimestamp();

    // Enable SPI Slave Select
    samr21TrxSetSSel(true);
    samr21delayLoop(CPU_WAIT_CYCLE_AFTER_SSEL_LOW);

    // Send Read Frame Buffer Command and get Status Byte (see r21 datasheet 35.4 Radio Transceiver Status Information)
    g_trxStatus.reg = samr21TrxSpiTransceiveByteRaw(AT86RF233_CMD_FRAMEBUFFER_READ);

    // First Byte is the msg Lenght
    samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
    buffer->inboundFrame.header.lenght = samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);
    buffer->downloadedSize = 1;

    

