dresden-elektronik/openthread-r21/src/HAL/samr21Radio.c
    if(buffer->inboundFrame.header.lenght > IEEE_802_15_4_PDSU_SIZE){
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_MSG_INVALID);
        samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
        samr21TrxSetSSel(false);
        __enable_irq();
        return;
    }

    // Download Recived Frame Till FCF
    while (buffer->downloadedSize <  4) //1Byte PhyHeader, 2Byte FCF, 1Byte Sequenz Number
    { 
        
        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        samr21delayLoop(CPU_WAIT_CYCLE_FOR_FRAME_BUFFER_EMPTY_FLAG);
        for(uint32_t timeout = 0; timeout < 0x005FFF; timeout++){
            if(!(PORT->Group[1].IN.reg & PORT_PB00)){
                break;
            }
        }
        //  while (PORT->Group[1].IN.reg & PORT_PB00);

        buffer->inboundFrame.raw[buffer->downloadedSize++] =
            samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);
    }

    //Extract Address Postion Infromation from recived Frame FCS
    uint8_t posSourceAddr, posDestinationAddr, posSourcePanId, posDestinationPanId;
    uint8_t curPosOffset = 4; // 1Byte PhyHeader, 2Byte FCF, 1Byte Sequenz Number

    //Destination PAN ID
    posDestinationPanId = curPosOffset;
    curPosOffset += sizeof(uint16_t);
    
    //Destination Addr
    if(buffer->inboundFrame.header.frameControlField2.destinationAddressingMode){
        posDestinationAddr = curPosOffset;
    }
    curPosOffset += 
        (( buffer->inboundFrame.header.frameControlField2.destinationAddressingMode & 0b10 ) ? sizeof(uint16_t) : 0 );
    curPosOffset += 
        (( buffer->inboundFrame.header.frameControlField2.destinationAddressingMode & 0b01 ) ? ( sizeof(uint64_t) - sizeof(uint16_t) ) : 0 );


    //Source PAN ID
    if(!(buffer->inboundFrame.header.frameControlField1.panIdCompression)){
        posSourceAddr = curPosOffset++;
    }
    //Source Addr
    if(buffer->inboundFrame.header.frameControlField2.sourceAddressingMode){
        posSourceAddr = curPosOffset;
    }
    curPosOffset += 
        (( buffer->inboundFrame.header.frameControlField2.sourceAddressingMode & 0b10 ) ? sizeof(uint16_t) : 0 );
    curPosOffset += 
        (( buffer->inboundFrame.header.frameControlField2.sourceAddressingMode & 0b01 ) ? ( sizeof(uint64_t) - sizeof(uint16_t) ) : 0 );

    // Download The Address Information data of the Frame 
    while (buffer->downloadedSize < curPosOffset)
    {
        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        samr21delayLoop(CPU_WAIT_CYCLE_FOR_FRAME_BUFFER_EMPTY_FLAG);
        for(uint32_t timeout = 0; timeout < 0x005FFF; timeout++){
            if(!(PORT->Group[1].IN.reg & PORT_PB00)){
                break;
            }
        }
        //  while (PORT->Group[1].IN.reg & PORT_PB00);

        buffer->inboundFrame.raw[buffer->downloadedSize++] =
            samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);
    }

    if ((buffer->inboundFrame.header.frameControlField2.destinationAddressingMode == IEEE_802_15_4_ADDR_SHORT))
    {
        for (uint8_t i = 0; i < sizeof(uint16_t); i++)
        {
            if(((uint8_t*) &s_panId)[i] != buffer->inboundFrame.raw[posDestinationPanId + i]){ //Little Endian Order
                samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_MSG_INVALID);
                samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
                samr21TrxSetSSel(false);
                __enable_irq();
                return;
            }
        } 


        for (uint8_t i = 0; i < sizeof(uint16_t); i++)
        {
            if(((uint8_t*) &s_shortAddr)[i] != buffer->inboundFrame.raw[posDestinationAddr + i]){ //Little Endian Order
                samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_MSG_INVALID);
                samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
                samr21TrxSetSSel(false);
                __enable_irq();
                return;
            }
        } 
    }

    if (buffer->inboundFrame.header.frameControlField2.destinationAddressingMode == IEEE_802_15_4_ADDR_IEEE)
    {
        for (uint8_t i = 0; i < sizeof(uint64_t); i++)
        {
            if(((uint8_t*) &s_ieeeAddr)[i] != buffer->inboundFrame.raw[posDestinationAddr + i]){ //Little Endian Order
                samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_MSG_INVALID);
                samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
                samr21TrxSetSSel(false);
                __enable_irq();
                return;
            }
        }   
    }

    if(buffer->inboundFrame.header.frameControlField2.sourceAddressingMode == IEEE_802_15_4_ADDR_SHORT){

        uint16_t shortAddr = buffer->inboundFrame.raw[posSourceAddr];//Little Endian Order
        shortAddr += (buffer->inboundFrame.raw[posSourceAddr + 1]) << 8;

        buffer->outboundFrame.header.frameControlField1.framePending = samr21RadioFindShortAddrInPendingFrameTable(shortAddr, false);

        //Does not work Beacause of no support for unaligned accesses on the Cortex-M0 processor.
        //(
            
            // sf_findShortAddrInPendingFrameTable(*((uint16_t *) &buffer->inboundFrame.raw[posSourceAddr]),  false ) ?
            // 1 : 0
        //);
    }

    if(buffer->inboundFrame.header.frameControlField2.sourceAddressingMode == IEEE_802_15_4_ADDR_IEEE){
        
        uint64_t ieeeAddr = buffer->inboundFrame.raw[posSourceAddr];//Little Endian Order
        ieeeAddr += (buffer->inboundFrame.raw[posSourceAddr+1]) << 8;
        ieeeAddr += (buffer->inboundFrame.raw[posSourceAddr+2]) << 16;
        ieeeAddr += (buffer->inboundFrame.raw[posSourceAddr+3]) << 24;
        ieeeAddr += (buffer->inboundFrame.raw[posSourceAddr+4]) << 32;
        ieeeAddr += (buffer->inboundFrame.raw[posSourceAddr+5]) << 40;
        ieeeAddr += (buffer->inboundFrame.raw[posSourceAddr+6]) << 48;
        ieeeAddr += (buffer->inboundFrame.raw[posSourceAddr+7]) << 56;
        
        buffer->outboundFrame.header.frameControlField1.framePending = samr21RadioFindIeeeAddrInPendingFrameTable(ieeeAddr, false);

        //Does not work Because of no support for unaligned accesses on the Cortex-M0 processor.
        // (
            //sf_findIeeeAddrInPendingFrameTable( *((uint64_t *) &buffer->inboundFrame.raw[posSourceAddr]), false ) ?
            //1 : 0
        // );
    }

    // Download The Remaining data of the Frame 
    while (buffer->downloadedSize <= buffer->inboundFrame.header.lenght)
    {
        samr21delayLoop(CPU_WAIT_CYCLE_FOR_FRAME_BUFFER_EMPTY_FLAG);

        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        for(uint32_t timeout = 0; timeout < 0x005FFF; timeout++){
            if(!(PORT->Group[1].IN.reg & PORT_PB00)){
                break;
            }
        }
        //while (PORT->Group[1].IN.reg & PORT_PB00);

        buffer->inboundFrame.raw[buffer->downloadedSize++] =
            samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);
    }

    // 3 Byte after the msg Frame are LQI,RSSI and CRC Informations (see r21 datasheet 35.3.2 Frame Buffer Access Mode)
    samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
    buffer->rxLQI = samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

    samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
    buffer->rxRSSI = AT86RF233_RSSI_BASE_VAL + samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

    AT86RF233_REG_RX_STATUS_t rxStatus = (AT86RF233_REG_RX_STATUS_t)samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

