dresden-elektronik/openthread-r21/src/HAL/samr21Radio.c
    // Disable Slave Select
    samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
    samr21TrxSetSSel(false);
    __enable_irq();

    //allrdy prep the trx to send ack (timing is critical)
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_FORCE_PLL_ON);


    if (!rxStatus.bit.crcValid)
    {
        //Abort sending Ack
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_MSG_INVALID);
        return;
    }

    // Check if Ack is needed
    if (sf_ringBufferGetCurrent()->inboundFrame.header.frameControlField1.ackRequest)
    {
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_ACK_REQUESTED);
        return;
    }

    // No Ack needed 
    // Abort sending Ack
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
    samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_MSG_VALID);
    return;
}

void fsm_func_samr21RadioSendAck()
{
    while (g_trxStatus.bit.trxStatus != TRX_STATUS_PLL_ON)
    {
        samr21TrxUpdateStatus();
    }
    __disable_irq();
    
    // Start Trasmission
    samr21TrxSetSLP_TR(true);
    // add tx timestamp
    JobBuffer_t * buffer = sf_ringBufferGetCurrent();

    buffer->txTimestamp = samr21RtcGetTimestamp();

    // Enable SPI Slave Select, to start uploading the Frame Payload in parallel while SHR is still being send
    samr21TrxSetSSel(true);
    samr21delayLoop(CPU_WAIT_CYCLE_AFTER_SSEL_LOW);

    // Transmission should have started here allrdy so trigger can be disabled
    samr21TrxSetSLP_TR(false);

    // Send Write Frame Buffer Command and get Status Byte (see r2 datasheet 35.4 Radio Transceiver Status Information)
    g_trxStatus.reg = samr21TrxSpiTransceiveByteRaw(AT86RF233_CMD_FRAMEBUFFER_WRITE);

    if (g_trxStatus.bit.trxStatus != TRX_STATUS_BUSY_TX)
    {
        samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
        samr21TrxSetSSel(false);

        //go Back to RX
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        samr21RadioFsmQueueSoftEvent(RADIO_EVENT_ERROR);

        __enable_irq();
        
        return;
    }

    //Preapre The Ack Package
    buffer->outboundFrame.header.sequenceNumber = 
        buffer->inboundFrame.header.sequenceNumber;
    buffer->outboundFrame.header.frameControlField1.ackRequest = 0;
    buffer->outboundFrame.header.frameControlField1.securityEnabled = 0;
    buffer->outboundFrame.header.frameControlField1.panIdCompression = 1;
    //buffer->outboundFrame.header.frameControlField1.framePending... is Set in function: samr21RadioLiveRxParser

    buffer->outboundFrame.header.frameControlField2.destinationAddressingMode = IEEE_802_15_4_ADDR_NONE;
    buffer->outboundFrame.header.frameControlField2.sourceAddressingMode = IEEE_802_15_4_ADDR_NONE;
    buffer->outboundFrame.header.frameControlField2.informationElementsPresent = 0;
    buffer->outboundFrame.header.frameControlField2.sequenceNumberSuppression = 0;
    buffer->outboundFrame.header.frameControlField2.frameVersion = IEEE_802_15_4_VERSION_2006;
    buffer->outboundFrame.header.lenght = 5;

    // Leave the Last 2 Bytes empty cause CRC is generated by at86rf233
    for (int16_t i = 0; i <= (sf_ringBufferGetCurrent()->outboundFrame.header.lenght - IEEE_802_15_4_CRC_SIZE); i++)
    {
        samr21delayLoop(CPU_WAIT_CYCLE_BETWEEN_BYTES);
        samr21TrxSpiTransceiveByteRaw(sf_ringBufferGetCurrent()->outboundFrame.raw[i]);
    }

    // Disable Slave Select
    samr21delaySysTick(CPU_WAIT_CYCLE_BEFORE_SSEL_HIGH);
    samr21TrxSetSSel(false);
    __enable_irq();

    // Queue Move to RX
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
}

void fsm_func_samr21RadioAbortLiveRxParser()
{
    __NOP();
}

void fsm_func_samr21EvalEd()
{   
    uint8_t edReading = samr21TrxReadRegister(PHY_ED_LEVEL_REG);

    if(sf_ringBufferGetCurrent()->measuredEngeryLevel < edReading){
        sf_ringBufferGetCurrent()->measuredEngeryLevel = edReading;
    }
}

void fsm_func_samr21EvalEdContinuation()
{   
    if (--(sf_ringBufferGetCurrent()->edTimeleft))
    {
        samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_START_ED);
        return;
    }

    samr21RadioFsmQueueSoftEvent(RADIO_SOFTEVENT_STOP_ED);
    return;
}